; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v6 - type_2 ?v1 - type_1)
 	      (pred_3 ?v2 - object ?v1 - type_1)
	      (pred_4 ?v6 - type_2 ?v5 - type_3)
	      (pred_1 ?v6 - type_2 ?v2 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v6 - type_2 ?v4 ?v8 - type_1)
       :precondition (and  (pred_2 ?v6 ?v4))
       :effect (and  (pred_2 ?v6 ?v8)
		     (not (pred_2 ?v6 ?v4))))

   (:action op_3
       :parameters (?v6 - type_2 ?v3 - object ?v7 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v7) (pred_2 ?v6 ?v7) (pred_4 ?v6 ?v5))
       :effect (and (pred_1 ?v6 ?v3 ?v5)
		    (not (pred_3 ?v3 ?v7)) 
		    (not (pred_4 ?v6 ?v5))))

   (:action op_1
       :parameters (?v6 - type_2 ?v3 - object ?v7 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v3 ?v5) (pred_2 ?v6 ?v7))
       :effect (and (pred_3 ?v3 ?v7)
		    (pred_4 ?v6 ?v5)
		    (not (pred_1 ?v6 ?v3 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_05 - type_2
obj_04 obj_06 - type_3
obj_03 obj_10 obj_09 obj_07 - type_1
obj_08 obj_01 obj_02 - object)
(:init
(pred_2 obj_05 obj_07)
(pred_4 obj_05 obj_04)
(pred_4 obj_05 obj_06)
(pred_3 obj_08 obj_07)
(pred_3 obj_01 obj_07)
(pred_3 obj_02 obj_09)
)
(:goal
(and
(pred_3 obj_08 obj_09)
(pred_3 obj_01 obj_07)
(pred_3 obj_02 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_05 ?b obj_04))))
)
)

; plan
1. (op_3 obj_05 obj_08 obj_07 obj_06)
   deleted: (pred_3 obj_08 obj_07) (pred_4 obj_05 obj_06)
   added: (pred_1 obj_05 obj_08 obj_06)
   goals met: 1 of 3
2. (op_2 obj_05 obj_07 obj_09)
   deleted: (pred_2 obj_05 obj_07)
   added: (pred_2 obj_05 obj_09)
   goals met: 1 of 3
3. (op_1 obj_05 obj_08 obj_09 obj_06)
   deleted: (pred_1 obj_05 obj_08 obj_06)
   added: (pred_3 obj_08 obj_09) (pred_4 obj_05 obj_06)
   goals met: 2 of 3
4. (op_3 obj_05 obj_02 obj_09 obj_06)
   deleted: (pred_3 obj_02 obj_09) (pred_4 obj_05 obj_06)
   added: (pred_1 obj_05 obj_02 obj_06)
   goals met: 2 of 3
5. (op_2 obj_05 obj_09 obj_07)
   deleted: (pred_2 obj_05 obj_09)
   added: (pred_2 obj_05 obj_07)
   goals met: 2 of 3
6. (op_1 obj_05 obj_02 obj_07 obj_06)
   deleted: (pred_1 obj_05 obj_02 obj_06)
   added: (pred_3 obj_02 obj_07) (pred_4 obj_05 obj_06)
   goals met: 3 of 3
